>## Create a DataFrame

In [2]:
import pandas as pd
from Class.Accounting import Accounting
from Class.Programming import Programming
from Class.Sale import Sale

>Create Employees
>Class Accounting
- Name
- Salary
- Age

> Class Programmer
- Name
- Salary
- Experience
- Skill

> Class Sale
- Name
- Salary
- Area

In [3]:
accounting = Accounting('Employee1', 200, 20)
programmer = Programming('Employee2', 100, 1, 'GameDev')
sale1 = Sale('Employee3', 150,'Chiang Mai')
sale2 = Sale('Employee4', 100,'Chiang Rai')

># Create DataFrame
> GetData Attributes

In [4]:
accounting.getData()

{'Name': 'Employee1',
 'Salary': 1200,
 'Department': 'Accounting',
 'Annual Income': 14400,
 'Age': 20}

> Series

In [5]:
ds_sale1 = pd.Series(sale1.getData())

#- For example: sale2 series format
ds_sale1

Name              Employee3
Salary                 1200
Department             Sale
Annual Income         14400
Area             Chiang Mai
dtype: object

> Create DataFrame from Series

In [6]:
ls_series = [accounting.getData(), programmer.getData(), sale1.getData(), sale2.getData()]
df = pd.DataFrame(ls_series)
df.set_index('Name', inplace = True)
df

,Salary,Department,Annual Income,Age,Experiment,Skill,Area
Name,,,,,,,
Employee1,1200,Accounting,14400,20.0,NaN,NaN,NaN
Employee2,1200,Programming,14400,NaN,1.0,GameDev,NaN
Employee3,1200,Sale,14400,NaN,NaN,NaN,Chiang Mai
Employee4,1200,Sale,14400,NaN,NaN,NaN,Chiang Rai

># TO CSV file&Exel file

In [7]:
df.to_csv('./Data/EmployeeDetails.csv')
df.to_excel('./Data/EmployeeDetailsTable.xlsx')